Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: When you’re signed in and synced, you’re safer. Firefox encrypts your passwords, bookmarks, and more.
ug: تىزىمغا كىرىپ قەدەمداشلىسىڭىز، تېخىمۇ بىخەتەر بولىسىز. Firefox ئىم، خەتكۈچ ۋە باشقىلارنى مەخپىيلەشتۈرىدۇ.

source: Who might be able to see my activity?
ug: پائالىيىتىمنى كىم كۆرەلەيدۇ؟

source: With Firefox on your home screen, you’ll have easy access to the privacy-first browser that blocks cross-site trackers.
ug: باش ئېكرانىڭىزغا Firefox نى جايلاشتۇرسىڭىز، شەخسىيەتنى ئەڭ ئالدىنقى ئورۇنغا قويىدىغان تور كۆرگۈنى خالىغان ۋاقىتتا زىيارەت قىلالايسىز، ئۇ بېكەت ھالقىغان ئىز قوغلاشنى توسىدىغان تور كۆرگۈ.

source: Would you like to leave %s to view this content?
ug: بۇ مەزمۇننى كۆرۈش ئۈچۈن %s دىن ئايرىلامسىز؟

source: Xiaomi devices may need extra permissions to add shortcuts to the home screen. Please check your settings.
ug: شياۋمى ئۈسكۈنىلىرىدە باش ئېكرانغا تېزلەتمە قوشۇشتا قوشۇمچە ئىجازەتكە ئېھتىياجلىق بولۇشى مۇمكىن. تەڭشەكلىرىڭىزنى تەكشۈرۈڭ.

source: Yesterday
ug: تۈنۈگۈن

source: Yes, try it
ug: ھەئە، سىناپ باقاي

source: You can easily add this website to your device’s Home screen to have instant access and browse faster with an app-like experience.
ug: تېز سۈرئەتتە زىيارەت قىلىش ۋە ئەپكە ئوخشاش زىيارەت تۇيغۇسىغا ئېرىشىش ئۈچۈن، مەزكۇر تور بېكەتنى باش ئېكرانغا ئاسانلا قوشالايسىز.

source: You can set %1$s to automatically open links in apps.
ug: ئەپتە ئۇلانمىلارنى ئۆزلۈكىدىن ئېچىشقا %1$s نى تەڭشىيەلەيسىز.

source: You don’t have any tabs open in Firefox on your other devices.
ug: كونا ئۈسكۈنىڭىزدە Firefox دا ھېچقانداق بەتكۈچ ئاچمىغان.

source: You have extensions installed, but not enabled
ug: كېڭەيتىلمە ئورنىتىلدى ئەمما قوزغىتىلمىدى

source: You’ll be logged out of most sites
ug: كۆپىنچە تور بېكەتلەردىكى تىزىمغا كىرىش ھالىتىدىن چېكىنىپ چىقىسىز

source: You’ll see fewer cookie requests
ug: سىز كۆرىدىغان cookie ئىلتىماسلىرى ئازىيىدۇ

source: You’ll see occasional ads for relevant products. All ads must meet our review quality standards. %s
ug: مۇناسىۋەتلىك مەھسۇلاتلارنىڭ ئېلانلىرىنى ئاندا-ساندا كۆرىسىز. بارلىق ئېلانلار چوقۇم باھالاش سۈپىتى ئۆلچىمىمىزگە ماس كېلىشى كېرەك. %s

source: You’ll see occasional ads for relevant products. We only advertise products with reliable reviews. %s
ug: مۇناسىۋەتلىك مەھسۇلاتلارنىڭ ئېلانلىرىنى ئاندا-ساندا كۆرىسىز. بىز پەقەت ئىشەنچلىك باھالانغان مەھسۇلاتلارغا ئېلان بېرىمىز. %s

source: You may want to block access if it's not clear why %s needs this data.
ug: ئەگەر %s بۇ سانلىق مەلۇماتلارنى نېمىگە ئىشلىتىدىغانلىقىنىڭ سەۋەبىنى ئېنىق بايان قىلمىسا، ئۇنى چەكلىشىڭىز كېرەك.

source: Your open tabs will be shown here.
ug: ئوچۇق بەتكۈچلىرىڭىز بۇ يەردە كۆرۈنىدۇ.

source: Your private tabs will be shown here.
ug: شەخسىي بەتكۈچلىرىڭىز بۇ يەردە كۆرۈنىدۇ.

source: Your tabs are syncing! Pick up where you left off on your other device.
ug: بەتكۈچلىرىڭىز قەدەمداشلىنىۋاتىدۇ! باشقا ئۈسكۈنىڭىزدە زىيارەتنى داۋاملاشتۇرالايسىز.

source: You’ve enabled HTTPS-Only Mode for enhanced security, and a HTTPS version of <em>%1$s</em> is not available.
ug: بىخەتەرلىكنى كۈچەيتىش ئۈچۈن پەقەت HTTPS-لا ھالىتىنى قوزغاتتىڭىز، <em>%1$s</em> نىڭ HTTPS نەشرىنى ئىشلەتكىلى بولمايدۇ.

source: Zip
ug: پوچتا نومۇرى

source: Zoom on all websites
ug: ھەممە تور بېكەتلەرنى چوڭايتىدۇ

source: 1. Go to Settings
ug: 1. تەڭشەككە يۆتكىلىڭ

source: 1. Go to *Settings*
ug: 1. *تەڭشەك* كە يۆتكىلىڭ

source: %1$@, issued to %2$@, ending in %3$@, expires %4$@
ug: ئاخىرقى نومۇرى %3$@ بولغان %1$@ كارتانىڭ ئىگىسى %2$@، ئىناۋەتلىك مۇددىتى %4$@

source: 1 of %d files
ug: 1/%dھۆججەت

source: %1$@ on %2$@
ug: %2$@ دىكى %1$@

source: %1$@ Sent from %2$@ 🦊 %3$@
ug: %1$@ نى %2$@ 🦊 %3$@ يوللىدى

source: %1$@ Sent from %2$@ 🦊 Try the mobile browser: %3$@
ug: %1$@ بۇ ئۇچۇر %2$@ 🦊دا يوللانغان، كۆچمە توركۆرگۈنى سىناڭ: %3$@

source: %1$@, switch button, %2$@.
ug: %1$@، ئالماشتۇرۇش توپچە، %2$@.

source: %1$@ tabs closed: %2$@
ug: %1$@ بەتكۈچ تاقالدى: %2$@

source: 2. Tap *Default Browser App*
ug: 2. *كۆڭۈلدىكى توركۆرگۈ ئەپ* نى چېكىڭ

source: 2. Tap Default Browser App
ug: 2. كۆڭۈلدىكى توركۆرگۈ ئەپنى چېكىڭ

source: 3. Select *%@*
ug: 3. *%@* نى تاللاڭ

source: 3. Select Firefox
ug: 3. Firefox نى تاللاڭ

source: Aa
ug: ئاا

source: Actual Size
ug: ئەمەلىي چوڭلۇقى

source: Ad by %@
ug: ئېلان بەرگۈچى %@

source: Add a Firefox shortcut to your Home screen. After adding the widget, touch and hold to edit it and select a different shortcut.
ug: باش بېتىڭىزگە Firefox تېزلەتمىسىنى قوشىدۇ. ئەپچە قوشقاندىن كېيىن، بېسىپ تۇرسا ئۇنى تەھرىرلەيدۇ ۋە باشقا تېزلەتمە تاللىغىلى بولىدۇ.

source: Add Bookmark
ug: خەتكۈچكە قوش

source: Add Card
ug: كارتا قوش

source: Add Credit Card
ug: ئىناۋەتلىك كارتا قوش

source: Added page to Reading List
ug: ئوقۇش تىزىمىغا بەت قوشۇلدى

source: Added Search engine!
ug: ئىزدەش موتورى قوشۇلدى!

source: Added to Reading List
ug: ئوقۇش تىزىمىغا قوشۇلدى

source: Added To Reading List
ug: ئوقۇش تىزىمىغا قوشۇلدى

source: Added to Shortcuts
ug: تېزلەتمىگە قوشۇلدى

source: Add Firefox shortcuts to your Home screen.
ug: باش بېتىڭىزگە Firefox تېزلەتمىسىنى قوشىدۇ.

source: Address and Search
ug: ئادرېس ۋە ئىزدەش

source: Address Bar
ug: ئادرېسس بالداق

source: Address Couldn’t Be Removed
ug: ئادرېسنى چىقىرىۋېتەلمەيدۇ

source: Address Couldn’t Be Saved
ug: ئادرېسنى ساقلىيالمايدۇ

source: Address for %@
ug: %@ نىڭ ئادرېسى

source: Address Information Updated
ug: ئادرېس ئۇچۇرى يېڭىلاندى

source: Address Removed
ug: ئادرېس چىقىرىۋېتىلدى

source: Address Saved
ug: ئادرېس ساقلاندى

source: Add Search Engine
ug: ئىزدەش موتورى قوش

source: Add Search Provider?
ug: ئىزدەش تەمىنلىگۈچىنى قوشامدۇ؟

source: Add shortcuts to frequently and recently visited sites.
ug: دائىم ۋە يېقىندا زىيارەت قىلغان تور بېكەتلەرگە تېزلەتمە قوشىدۇ.

source: Add shortcuts to your open tabs.
ug: ئوچۇق بەتكۈچكە تېزلەتمە قوشىدۇ.

source: Add Tab
ug: بەتكۈچ قوش

source: Add to Bookmarks
ug: خەتكۈچكە قوش

source: Add to calendar?
ug: يىلنامىگە قوشامدۇ؟

source: Add to Home Screen
ug: باش ئېكرانغا قوش

source: Add to Reading List
ug: ئوقۇش تىزىمىغا قوش

source: Add to Shortcuts
ug: تېزلەتمىگە قوش

source: A device has disconnected from Firefox Sync
ug: بىر ئۈسكۈنە Firefox Sync قەدەمداشتىن ئۈزۈلدى

source: Align QR code within frame to scan
ug: تاراش ئۈچۈن QR كودى رامكا ئىچىدە توغرىلىنىدۇ

source: Allows some ad tracking so websites function properly.
ug: بەزى ئېلاننىڭ ئىز قوغلىشىغا يول قويىدۇ، شۇڭا تور بېكەتلەر نورمال ئىشلەيدۇ.

source: Allow %@ to open?
ug: %@ نىڭ ئېچىشىدا يول قويامدۇ؟

source: Alternate Search Engines
ug: زاپاس ئىزدەش موتورى

source: Alternative Search Engines
ug: زاپاس ئىزدەش موتورى

source: Always Send
ug: ھەمىشە يوللا

source: Amazon
ug: ئامازون

source: Analysis Is Up To Date
ug: ئەڭ يېڭى تەھلىل

source: An error occured while adding the pass to Wallet. Please try again later.
ug: ھەميانغا ئىم قوشقاندا خاتالىق كۆرۈلدى. كېيىن قايتا سىناڭ.

source: An SSL error has occurred and a secure connection to the server cannot be made.
ug: SSL خاتالىقى يۈز بەردى، مۇلازىمېتىرغا بىخەتەر باغلىنالمايدۇ.

source: Area
ug: رايون

source: Are you sure you want to cancel this download?
ug: بۇ چۈشۈرۈشتىن راستىنلا ۋاز كېچەمسىز؟

source: Are you sure you want to delete it and its contents?
ug: ئۇنىڭغا مەزمۇنلىرىنىمۇ قوشۇپ راستىنلا ئۆچۈرەمسىز؟

source: Articles powered by %@
ug: ماقالە تەمىنلىگۈچى %@

source: A search engine with this title or URL has already been added.
ug: بۇ ماۋزۇ ياكى تور ئادرېسى بار ئىزدەش موتورى ئاللىقاچان قوشۇلدى.

source: A username and password are being requested by %@.
ug: ئىشلەتكۈچى ئىسمى ۋە پارولنى %@ ئىلتىماس قىلدى.

source: A username and password are being requested by %1$@. The site says: %2$@
ug: ئىشلەتكۈچى ئىسمى ۋە پارولنى %1$@ ئىلتىماس قىلدى. تور بېكەتنىڭ قايتۇرغىنى: %2$@

source: Authenticate to access passwords.
ug: ئىمنى زىيارەت قىلىش ئۈچۈن دەلىللىنىدۇ.

source: Authenticate to access your saved logins and encrypted cards.
ug: ساقلىغان تىزىمغا كىرىش ئۇچۇرى ۋە شىفىرلانغان كارتا ئۇچۇرىنى زىيارەت قىلىش ئۈچۈن دەلىللىنىدۇ.

source: Authenticate to access your saved passwords and payment methods.
ug: ساقلىغان ئىم ۋە چىقىم قىلىش ئۇسۇلىنى زىيارەت قىلىشنى دەلىللەيدۇ.

source: Authentication required
ug: دەلىللەش زۆرۈر

source: Autofill Addresses
ug: ئادرېسنى ئۆزلۈكىدىن تولدۇر

source: Autofill Credit Cards
ug: ئىناۋەتلىك كارتىنى ئۆزلۈكىدىن تولدۇر

source: AutoFill Firefox Passwords
ug: Firefox ئىمنى ئۆزلۈكىدىن تولدۇر

source: Automatically
ug: ئاپتوماتىك

source: Available devices:
ug: ئىشلىتىشچان ئۈسكۈنىلەر:

source: Be careful on this site
ug: بۇ تور بېكەتتىن ئېھتىيات قىلىڭ

source: Be careful. Something doesn’t look right.
ug: ئېھتىيات قىلىڭ. بىرەر نەرسە توغرا ئەمەستەك قىلىدۇ.

source: Blank Page
ug: بوش بەت

source: Block Images
ug: سۈرەتنى توس

source: Block Opening External Apps
ug: سىرتقى ئەپ ئېچىشنى چەكلەيدۇ

source: Block Pop-up Windows
ug: قاڭقىش كۆزنىكىنى توس

source: BLOCKS
ug: توسقانلىرى

source: Blocks more trackers, ads, and popups. Pages load faster, but some functionality may not work.
ug: تېخىمۇ كۆپ ئىز قوغلىغۇچ، ئېلان ۋە قاڭقىش كۆزنەكلىرىنى توسىدۇ. بەتلەر تېز يۈكلىنىدۇ، ئەمما بەزى ئىقتىدارى ئىشلىمەسلىكى مۇمكىن.

source: Bookmark Added
ug: خەتكۈچ ساقلاندى

source: Bookmarked
ug: خەتكۈچكە قوشۇلدى

source: Bookmark Link
ug: خەتكۈچ ئۇلانمىسى

source: Bookmark Removed
ug: خەتكۈچ چىقىرىۋېتىلدى

source: Bookmark This Page
ug: بۇ بەتنى خەتكۈچكە قوش

source: Brightness
ug: يورۇقلۇقى

source: Browse with no saved cookies or history in %@.
ug: %@ زىيارەت داۋامىدا cookies ۋە تارىخ خاتىرىسىنى ساقلىمايدۇ.

source: Browsing History
ug: زىيارەت تارىخى

source: Built-in Enhanced Tracking Protection helps stop ads from following you around. Turn on Strict to block even more trackers, ads, and popups.
ug: ئىچكى كۈچەيتىلگەن ئىزلاشتىن قوغداش ئېلانلارنىڭ سىزگە ئەگىشىشىنى توختىتىدۇ. تېخىمۇ قاتتىق ئىزلاش، ئېلان ۋە قاڭقىش كۆزنەكلىرىنى چەكلەش ئۈچۈن قاتتىق ھالەتنى ئېچىڭ.

source: By selecting “Yes, Try It” you agree to the following from %@:
ug: «ھەئە، سىناپ باقاي» تاللانسا تۆۋەندىكى %@ غا قوشۇلغان بولىسىز:

source: By selecting “Yes, Try It” you agree to these items:
ug: «ھەئە، سىناپ باقاي» تاللانسا تۆۋەندىكى تۈرلەرگە قوشۇلغان بولىسىز:

source: Cache
ug: غەملەك

source: Cancel Download
ug: چۈشۈرۈشتىن ۋاز كەچ

source: Cannot Open Page
ug: بەتنى ئاچقىلى بولمايدۇ

source: Can’t Check These Reviews
ug: بۇ باھالاشلارنى تەكشۈرەلمەيدۇ

source: Card Information updated
ug: كارتا ئۇچۇرى يېڭىلاندى

source: Card Information Updated
ug: كارتا ئۇچۇرى يېڭىلاندى

source: Card Removed
ug: كارتا چىقىرىۋېتىلدى

source: Certificate
ug: گۇۋاھنامە

source: Changes color theme.
ug: رەڭ ئۆرنىكىنى ئۆزگەرتىدۇ.

source: Changes font type.
ug: خەت شەكلىنى ئۆزگەرتىدۇ.

source: Change wallpaper by tapping Firefox homepage logo
ug: Firefox نىڭ باش بەت تۇغىنى چېكىپ تام قەغىزىنى ئۆزگەرتكىلى بولىدۇ

source: Checking review quality (%@)
ug: باھالاش سۈپىتىنى تەكشۈرۈۋاتىدۇ(%@)

source: Check Now
ug: ھازىر تەكشۈر

source: Check Review Quality
ug: باھالاش سۈپىتىنى تەكشۈر

source: Choose a %@ Wallpaper
ug: بىر %@ تام قەغىزى تاللىنىدۇ

source: Choose Firefox as your default browser to make speed, safety, and privacy automatic.
ug: سۈرئەت، بىخەتەرلىك ۋە مەخپىيەتلىكنى ئاپتوماتىك قىلىش ئۈچۈن Firefox نى كۆڭۈلدىكى توركۆرگۈڭىز قىلىپ تاللاڭ.

source: Choose what displays as the homepage.
ug: باش بەتتە نېمە كۆرسىتىدىغانلىقى تاللىنىدۇ.

source: Choose what’s included on the Firefox homepage.
ug: Firefox نىڭ باش بېتى نېمىنى ئۆز ئىچىگە ئالىدىغانلىقى تاللىنىدۇ.

source: Choose what to load when opening a new tab
ug: يېڭى بەتكۈچ ئاچقاندا نېمىلەرنى يۈكلەش تاللىنىدۇ

source: Choose what you see when you return to Firefox.
ug: Firefox قا قايتقاندا كۆرۈنىدىغان مەزمۇن تاللىنىدۇ.

source: Classic %@
ug: ئەنئەنىۋى %@

source: Classic Wallpaper
ug: ئەنئەنىۋى تام قەغىزى

source: Clear All Website Data
ug: بارلىق تور بېكەت سانلىق مەلۇماتلىرىنى تازىلا

source: Clear Items: %1$@
ug: تۈرنى تازىلاش: %1$@

source: Clear Private Data
ug: شەخسىي سانلىق مەلۇماتنى تازىلا

source: Clear Private Tabs
ug: شەخسىي بەتكۈچنى تازىلا

source: Clear Recent History
ug: يېقىنقى تارىخنى تازىلايدۇ

source: Clear Recent History…
ug: يېقىنقى تارىخنى تازىلا…

source: Clear Search
ug: ئىزدەشنى تازىلا

source: Close All Inactive Tabs
ug: بارلىق ئاكتىپسىز بەتكۈچلەرنى تاقا

source: Close all private tabs and delete history, cookies, and all other site data.
ug: بارلىق شەخسىي بەتكۈچلەرنى تاقاپ، تارىخ، ساقلانما ۋە باشقا تور بېكەت سانلىق مەلۇماتلىرىنى ئۆچۈرىدۇ.

source: Close All Tabs
ug: ھەممە بەتكۈچنى ياپ

source: Close and exit %@ onboarding
ug: يولباشچى %@ نى تاقاپ چېكىن

source: Close privacy and security menu
ug: شەخسىيەت ۋە بىخەتەرلىك تىزىملىكىنى تاقا

source: Close Private Tabs
ug: شەخسىي بەتكۈچنى ياپ

source: Close Review Checker
ug: باھالاش تەكشۈرگۈچنى تاقا

source: Close Survey
ug: راي سىناشنى تاقا

source: Close Survey Prompt
ug: راي سىناش ئەسكەرتىشىنى تاقا

source: Close Tab
ug: بەتكۈچنى ياپ

source: Close This Tab
ug: بۇ بەتكۈچنى ياپ

source: Close Zoom Panel
ug: چوڭايتىش تاختىسىنى ياپ

source: Closing tab
ug: تاقالغان بەتكۈچ

source: Collapse How we determine review quality Card
ug: تەكشۈرۈپ باھالاش سۈپىتىنى قانداق بېكىتىمىز كارتىسىنى ياي

source: Collapse Settings Card
ug: تەڭشەك كارتىسىنى يىغ

source: Committed to the promise of a better Internet for everyone.
ug: تېخىمۇ ياخشى ئىنتېرنېت بەرپا قىلىش ئۈچۈن كۆپچىلىك بەرگەن ۋەدىسىگە ئەمەل قىلىدۇ.

source: Common Name
ug: ئادەتتىكى ئات

source: Conceal
ug: يوشۇرۇن

source: Connection not secure
ug: باغلىنىش بىخەتەر ئەمەس

source: Connection not secure. Enhanced Tracking Protection is off.
ug: باغلىنىش بىخەتەر ئەمەس. كۈچەيتىلگەن ئىز قوغلاشتىن قوغداش تاقاق.

source: Cookies and site data removed
ug: ساقلانما ۋە تور بېكەت سانلىق مەلۇماتلىرى چىقىرىۋېتىلدى

source: Copy Address
ug: ئادرېسنى كۆچۈر

source: Copy Image
ug: سۈرەت كۆچۈر

source: Copy Image Link
ug: سۈرەت ئۇلانمىسىنى كۆچۈر

source: Copy Link
ug: ئۇلانمىنى كۆچۈر

source: Copy URL
ug: URL نى كۆچۈر

source: Could not add page to Reading list
ug: ئوقۇش تىزىمىغا بەت قوشالمىدى

source: Could not add page to Reading List. Maybe it’s already there?
ug: ئوقۇش تىزىمىغا بەت قوشالمىدى. بەلكىم ئۇ مەۋجۇتمۇ؟

source: Could not load page.
ug: بەتنى يۈكلىيەلمىدى.

source: Couldn’t Change Wallpaper
ug: تام قەغىزىنى ئالماشتۇرالمىدى

source: Couldn’t Download Wallpaper
ug: تام قەغىزىنى چۈشۈرەلمىدى

source: Country
ug: دۆلەت

source: Country or Region
ug: دۆلەت ياكى رايون

source: County
ug: ناھىيە

source: %@ crashed. Restore your tabs?
ug: %@ يىمىرىلدى. بەتكۈچلىرىڭىزنى ئەسلىگە كەلتۈرسۇنمۇ؟

source: Create an account
ug: ھېسابات قۇر

source: Created %@
ug: قۇرۇلغان ۋاقتى %@

source: Credit Cards
ug: ئىناۋەتلىك كارتا

source: Cross-Site Trackers
ug: بېكەت ھالقىغان ئىزلىغۇچى

source: Cross-site tracking cookies: %@
ug: بېكەت ھالقىغان ئىزلاش ساقلانمىسى: %@

source: Cryptominers secretly use your system’s computing power to mine digital money. Cryptomining scripts drain your battery, slow down your computer, and can increase your energy bill.
ug: شىفىرلىق پۇل قازغۇچ سىستېمىڭىزنىڭ ھېسابلاش كۈچىنى مەخپىي ئىشلىتىپ رەقەملىك پۇل قازىدۇ. شىفىرلىق پۇل قازغۇچ قوليازمىسى باتارېيەڭىزنى خورىتىدۇ، كومپيۇتېرىڭىزنى ئاستىلىتىدۇ ۋە توك ئىشلىتىش چىقىمىڭىزنى ئاشۇرۇۋېتىدۇ.

source: Current Homepage
ug: نۆۋەتتىكى باش بەت

source: Currently selected tab.
ug: نۆۋەتتە تاللانغان بەتكۈچ.

source: Current Zoom Level: %@
ug: نۆۋەتتىكى چوڭايتىش دەرىجىسى: %@

source: Customize %@
ug: %@ ئىختىيارىچە

source: Customize Homepage
ug: باش بەتنى خاسلاشتۇر

source: Customize Tab Tray
ug: ئىختىيارى بەتكۈچ تەخسە

source: Custom URL
ug: ئىختىيارى تور ئادرېسى

source: Data Clearance
ug: سانلىق مەلۇمات تازىلاش

source: Data Management
ug: سانلىق مەلۇمات باشقۇرۇش

source: Decrease text size
ug: تېكىست چوڭلۇقىنى كىچىكلەت

source: Decrease Zoom Level
ug: چوڭايتىش دەرىجىسىنى تۆۋەنلەت

source: Default Browser App
ug: كۆڭۈلدىكى توركۆرگۈ ئەپى

source: Default clear wallpaper.
ug: كۆڭۈلدىكى يورۇق تام قەغەز.

source: Default Search Engine
ug: كۆڭۈلدىكى ئىزدەش موتورى

source: Default to a Better Internet
ug: تېخىمۇ گۈزەل ئىنتېرنېت ئۈچۈن كۆڭۈلدىكىگە تەڭشەيدۇ

source: Delete all sites in %@?
ug: %@ دىكى بارلىق تور بېكەتلەرنى ئۆچۈرەمدۇ؟

source: Delete Bookmark
ug: خەتكۈچ ئۆچۈر

source: Deleted “%@”
ug: «%@» ئۆچۈرۈلدى

source: Delete Folder
ug: قىسقۇچ ئۆچۈر

source: Delete from History
ug: تارىختىن ئۆچۈر

source: Delete session data
ug: سۆزلىشىش سانلىق مەلۇماتىنى ئۆچۈرىدۇ

source: %@ deletes your cookies, history, and site data when you close all your private tabs.
ug: بارلىق شەخسىيەت بەتكۈچلىرى تاقالغاندا، %@ سىزنىڭ ساقلانما (cookies)، تارىخ ۋە تور بېكەت سانلىق مەلۇماتلىرىڭىزنى ئۆچۈرىدۇ.

source: %@ deletes your cookies, history, and site data when you close all your private windows.
ug: بارلىق شەخسىيەت كۆزنەكلىرى تاقالغاندا، %@ سىزنىڭ cookies، تارىخ ۋە تور بېكەت سانلىق مەلۇماتلىرىڭىزنى ئۆچۈرىدۇ.

source: Department
ug: ئۆلكە

source: Deselect All
ug: ھەممىنى تاللىما

source: Device Name
ug: ئۈسكۈنە ئىسمى

source: Dimmed
ug: چەكلەنگەن

source: Disconnect Sync
ug: قەدەمداشنى ئۈز

source: Disconnect Sync?
ug: قەدەمداشنى ئۈزەمدۇ؟

source: Display Settings
ug: تەڭشەكلەرنى كۆرسەت

source: District
ug: ئالاھىدە رايون

source: %d min
ug: %d مىنۇت

source: +%d More…
ug: + يەنە %d …

source: DNS Name
ug: DNS ئىسمى

source: Don’t Save
ug: ساقلىما

source: Don’t Send
ug: يوللىما

source: Don’t Update
ug: يېڭىلىما

source: Do/Si
ug: شەھەر

source: Double tap and hold for more options
ug: قوش چېكىپ بېسىپ تۇرۇلسا تېخىمۇ كۆپ تاللانما كۆرۈنىدۇ

source: Double tap to toggle setting.
ug: قوش چېكىلسە تەڭشەكنى ئالماشتۇرىدۇ.

source: Download Cancelled
ug: چۈشۈرۈش ئەمەلدىن قالدۇرۇلدى

source: Downloaded Files
ug: چۈشۈرۈلگەن ھۆججەتلەر

source: Downloaded files will show up here.
ug: چۈشۈرگەن ھۆججەتلەر بۇ يەردە كۆرۈنىدۇ.

source: Download Failed
ug: چۈشۈرۈش مەغلۇپ بولدى

source: Download Link
ug: ئۇلانمىنى چۈشۈر

source: Download Now
ug: ھازىر چۈشۈر

source: Download PDF
ug: PDF چۈشۈر

source: %d tab(s) closed
ug: %d بەتكۈچ تاقالدى

source: Edit Bookmark
ug: خەتكۈچ تەھرىر

source: Edit Card
ug: كارتا تەھرىر

source: Edit Credit Card
ug: ئىناۋەتلىك كارتا تەھرىرلەش

source: Edit Folder
ug: قىسقۇچ تەھرىر

source: Eircode
ug: پوچتا نومۇرى

source: Elevate Everyday Browsing
ug: كۈندىلىك زىيارەتنى يۈكسەلتىدۇ

source: Emirate
ug: ئەمىرلىكى

source: %@ encrypts your card number. Your security code won’t be saved.
ug: %@ كارتا نومۇرىڭىزنى شىفىرلايدۇ. بىخەتەرلىك كودىڭىز ساقلانمايدۇ.

source: %@ encrypts your passwords, bookmarks, and more when you’re synced.
ug: سىز قەدەمداشلىغاندا %@ ئىم، خەتكۈچ ۋە باشقىلارنى شىفىرلايدۇ.

source: End your private session?
ug: شەخسىي سۆزلىشىشىڭىزنى ئاخىرلاشتۇرامدۇ؟

source: Enter a valid expiration date
ug: كۈچكە ئىگە مۇددىتىنى كىرگۈزۈڭ

source: Enter passcode
ug: مەخپىي نومۇرنى كىرگۈزۈڭ

source: Enter Search Mode
ug: ئىزدەش ھالىتىگە كىرىدۇ

source: Enter your password to connect
ug: ئۇلاش ئۈچۈن پارولىڭىزنى كىرگۈزۈڭ

source: Expand How we determine review quality card
ug: تەكشۈرۈپ باھالاش سۈپىتىنى قانداق بېكىتىمىز كارتىسىنى يىغ

source: Expand Settings Card
ug: تەڭشەك كارتىسىنى ياي

source: Expiration MM / YY
ug: مۇددىتى MM / YY

source: Expires
ug: قەرەلى

source: Expires %@
ug: قەرەلى %@

source: Failed
ug: مەغلۇب بولدى

source: Failed to Add Pass
ug: ئىم قوشالمىدى

source: Filter
ug: سۈزگۈچ

source: Filter Sites
ug: بېكەت سۈزگۈچ

source: Find
ug: ئىزدە

source: Find Again
ug: قايتا ئىزدە

source: Find in Page
ug: بەتتىن ئىزدە

source: Find in Page…
ug: بەتتىن ئىزدە…

source: Fingerprinters: %@
ug: ئىز قالدۇرغۇ: %@

source: Firefox blocks 3,000+ trackers per user each month on average. Make us your default browser for privacy peace of mind.
ug: Firefox ھەر ئايدا ئوتتۇرا ھېساب بىلەن ھەر بىر ئىشلەتكۈچىگە 3000 دىن كۆپ ئىز قوغلىغۇچنى توسىدۇ. شەخسىي خاتىرجەملىك ئۈچۈن بىزنى كۆڭۈلدىكى توركۆرگۈڭىزگە ئايلاندۇرۇڭ.

source: Firefox cannot open the page because it has an invalid address.
ug: Firefox بۇ بەتنى ئاچالمايدۇ، چۈنكى ئادرېس ئىناۋەتسىز.

source: Firefox Has Privacy Covered
ug: Firefox شەخسىيەتنى قوغدايدۇ

source: Firefox Home
ug: Firefox باش بەت

source: Firefox Home Page
ug: Firefox باش بېتى

source: Firefox logo, change the wallpaper.
ug: Firefox تۇغى، تام قەغىزىنى ئۆزگەرتىدۇ.

source: Firefox may install and run studies from time to time.
ug: Firefox پات-پات تەتقىقاتلارنى ئورنىتىپ ئىجرا قىلالايدۇ.

source: Firefox requires Face ID to access your saved passwords and payment methods.
ug: Firefox ساقلانغان ئىم ۋە پۇل تۆلەش ئۇسۇلىڭىزنى زىيارەت قىلىش ئۈچۈن چىراي كىملىكىنى تەلەپ قىلىدۇ.

source: Firefox Shortcuts
ug: Firefox تېزلەتمىسى

source: Firefox Sync
ug: Firefox قەدەمداش

source: Firefox Sync has connected to %@
ug: Firefox قەدەمداش %@ غا باغلاندى

source: Firefox uses your camera to scan QR codes and take photos and video.
ug: Firefox كامېرا ئارقىلىق QR كودىنى تارايدۇ ھەمدە سۈرەت تارتىپ ۋە سىنغا ئالىدۇ.

source: Firefox uses your microphone to record and upload audio.
ug: Firefox مىكروفونىڭىزنى ئىشلىتىپ ئۈنگە ئالىدۇ ۋە يۈكلەيدۇ.

source: Firefox wallpaper, amethyst pattern.
ug: Firefox تام قەغىزى ، ئامېتىست ئەندىزىسى.

source: Firefox wallpaper, beach hills pattern.
ug: Firefox تام قەغىزى ، ساھىل تاغ ئەندىزىسى.

source: Firefox wallpaper, cerulean pattern.
ug: Firefox تام قەغىزى، ھاۋا رەڭ ئەندىزە.

source: Firefox wallpaper, sunrise pattern.
ug: Firefox تام قەغىزى، كۈن چىقىش ئەندىزە.

source: Firefox wallpaper, twilight hills pattern.
ug: Firefox تام قەغىزى ، شەپەقتىكى تاغ ئەندىزىسى.

source: Firefox will stop syncing with your account, but won’t delete any of your browsing data on this device.
ug: Firefox ھېساباتىڭىز بىلەن قەدەمداشلاشنى توختىتىدۇ، ئەمما بۇ ئۈسكۈنىدىكى توركۆرگۈ سانلىق مەلۇماتلىرىڭىزنى ئۆچۈرمەيدۇ.

source: Firefox won’t remember any of your history or cookies, but new bookmarks will be saved.
ug: Firefox سىزنىڭ زىيارەت تارىخىڭىز ياكى ساقلانمىڭىزنى ئەستە تۇتمايدۇ، ئەمما خەتكۈچلىرىڭىزنى ساقلايدۇ.

source: Firefox would like to access your Photos
ug: Firefox سىزنىڭ سۈرەتلىرىڭىزنى زىيارەت قىلماقچى

source: Folder
ug: قىسقۇچ

source: Generate a new strong password
ug: يېڭى كۈچلۈك ئىم ھاسىللايدۇ

source: Generated password: %@
ug: ھاسىللىغان ئىم: %@

source: Get Help
ug: ياردەمگە ئېرىش

source: Get Started
ug: باشلايلى

source: Get suggestions from %@ related to your search
ug: %@ دىن ئىزدىگىنىڭىزگە مۇناسىۋەتلىك تەۋسىيەگە ئېرىشىسىز

source: Go
ug: يۆتكەل

source: Got It
ug: بىلدىم

source: Go to
ug: يۆتكەل

source: Go to copied link
ug: كۆچۈرۈلگەن ئۇلانمىغا يۆتكەل

source: Go to copied link?
ug: كۆچۈرۈلگەن ئۇلانمىغا يۆتكىلەمدۇ؟

source: Go to Copied Link
ug: كۆچۈرۈلگەن ئۇلانمىغا يۆتكەل

source: Go to device ‘Settings’ > ‘Firefox’. Allow Firefox to access camera.
ug: ئۈسكۈنىنىڭ «تەڭشەكلەر»›«Firefox» قا يۆتكىلىڭ. Firefox نىڭ كامېرانى زىيارەت قىلىشىغا يول قويۇڭ.

source: Go to your device Settings to turn on notifications in %@
ug: ئۈسكۈنىڭىزنىڭ تەڭشەكلىرىگە كىرىپ %@ دىكى ئۇقتۇرۇشنى ئېچىڭ

source: Grade %@
ug: دەرىجە %@

source: %@ has been successfully disconnected.
ug: %@ مۇۋەپپەقىيەتلىك ئۈزۈلدى.

source: Heads up!
ug: دىققەت!

source: Help us make %@ better. It only takes a minute.
ug: %@ نى ياخشىلىشىمىزغا ياردەم قىلىڭ. بۇنىڭغا پەقەت بىر مىنۇتلا ۋاقىت كېتىدۇ.

source: Hide
ug: يوشۇر

source: Hide Inactive Tabs
ug: ئاكتىپسىز بەتكۈچنى يوشۇرىدۇ

source: *Highlights* are from %1@ reviews within the last 80 days that we believe to be reliable.
ug: *يارقىن نۇقتىلار* بىز ئىشەنچلىك دەپ قارىغان يېقىنقى 80 كۈن ئىچىدىكى %1@ باھادىن كەلگەن.

source: *Highlights* are from %@ reviews within the last 80 days that we believe to be reliable.
ug: *يارقىن نۇقتىلار* بىز ئىشەنچلىك دەپ قارىغان يېقىنقى 80 كۈن ئىچىدىكى %@ باھادىن كەلگەن.

source: Home
ug: باشبەت

source: Homepage wallpaper cycle toggle
ug: باش بەت تام قەغىزىنى ئالماشتۇرۇش ئۈزچاتى

source: If a site doesn’t work as expected, tap the lock in the address bar and turn off Enhanced Tracking Protection for that page.
ug: ئەگەر بىر تور بېكەت كۈتكەندەك ئىشلىمىسە، ئادرېس بالداقتىكى قۇلۇپنى چېكىپ، بۇ بەتتىكى كۈچەيتىلگەن ئىزلاشتىن قوغلاشنى تاقاڭ.
